values = """('044111111', 'Филиал Некого Банка в г.Ростове-на-Дону', '9999', '0001'),
('044222222', 'Филиал Некого Банка в г.Москве', '9999', '0002'),
('044333333', 'Филиал Некого Банка в г.Санкт-Петербурге', '9999', '0003'),
('044444444', 'Филиал Некого Банка в г.Воронеже', '9999', '0004'),
('044555555', 'Филиал Некого Банка в г.Чебоксары', '9999', '0005'),
('044666666', 'Филиал Некого Банка в г.Нижнем  Новогороде', '9999', '0006')"""
data_base.add_values('banks', values)

values = """('ООО "Рога и копыта"', '1111111111', '111111111', '1111111111111', 
            '2000-01-01', 'Ростовская область', 'Ростов-на-Дону', 'Некая', 1, 1),
('ЗАО "Копыта и рога"', '2222222222', '222222222', '2222222222222', 
            '2001-02-02', 'Ростовская область', 'Азов', 'Другая', 2, 1),
('ПАО "Рог у копыта"', '3333333333', '333333333', '3333333333333', 
            '2002-03-03', 'Ростовская область', 'Каменск-Шахтинск', 'Непонятная', 3, 1),
('ГУП "Копыта без рогов"', '4444444444', '333333333', '4444444444444', 
            '2003-04-04', 'Ростовская область', 'Шахты', 'Тасамая', 4, 1)"""
data_base.add_values('clients', values)

values = """('40702810000000000001', 1, 3), 
('40702840000000000001', 1, 4), 
('40702978000000000001', 1, 6), 
('40702810000000000002', 2, 3), 
('40702156000000000002', 2, 1), 
('40702810000000000003', 3, 3), 
('40702840000000000003', 3, 4), 
('40702398000000000003', 3, 2), 
('40702810000000000004', 4, 3)"""
data_base.add_values('accounts', values)

values = """('112', 'Белорусский рубль'), 
('156', 'Китайский юань'),
('398', 'Казахский тенге'), 
('643', 'Рубль РФ'), 
('840', 'Доллар США'),
('860', 'Узбекский сом'),
('978', 'Евро')
"""
data_base.add_values('val_code', values)

values = """('Внешбелорг', 1, 1), 
('China some org', 2, 2), 
('Казахорг', 3, 3), 
('Узбеквнешторг', 4, 5)"""
data_base.add_values('counter_party', values)

values = """('Белторгбанк', 1, 1), 
('Bank of China', 2, 2), 
('Казкомбанк', 3, 3), 
('Узбекбанк', 4, 5)"""
data_base.add_values('counter_party_bank', values)

values = """('112', 'Республика Белорусь'), 
('156', 'Китай'),
('398', 'Казахстан'), 
('643', 'Росиийская Федерация'), 
('860', 'Узбекистан')"""
data_base.add_values('country_code', values)

values = """('24010001/9999/0001/2/1', '2024-01-01', '1-A', '2023-12-12', '1000000', '2025-12-31', 1, 1, 4),
('23080004/9999/0001/2/1', '2023-08-15', 'CN-5', '2023-07-01', '500000', '2024-12-31', 2, 2, 2),
('23120015/9999/0001/2/1', '2023-12-10', '101223', '2023-12-01', '30000000', '2026-10-01', 3, 3, 3),
('22100005/9999/0001/2/1', '2022-10-10', '15-UZ', '2022-09-25', '15000000', '2024-12-31', 4, 4, 4)
"""
data_base.add_values('unic_contr_numb', values)

values = """('2024-06-01','2', '11200', '1000000', '', 1, 4),
('2024-07-15','2', '11100', '1560000', '2024-12-31', 1, 4),
('2024-08-07','2', '11100', '300000', '2024-12-31', 1, 4),
('2024-09-01','2', '11200', '2500000', '', 1, 4),
('2023-10-01','2', '11100', '3000', '2023-12-31', 2, 2),
('2024-04-01','2', '11100', '10000', '2024-06-01', 2, 2),
('2024-08-01','2', '11100', '14000', '2024-10-15', 2, 2),
('2024-01-10','2', '21100', '1200000', '2024-09-30', 3, 3),
('2024-06-15','2', '21200', '2800000', '', 3, 3),
('2024-06-15','2', '12060', '15000000', '', 4, 4)
"""
data_base.add_values('payments', values)

values = """('10216100/030424/0001564','', '01_4', '1000000', '','4','', 1, 4),
('10216100/150924/0002845','', '01_4', '2800000', '300000','3','', 1, 4),
('10013060/010724/0007115','', '01_4', '13000', '','3','', 2, 4),
('1','2024-08-01', '04_4', '2800000', '','4','', 3, 3)
"""
data_base.add_values('supp_doc', values)